<strong>NumPy</strong>
-- Foundational data structure, in Python, and powerful tool in which other powerful tools are built upon, such as SciPy, Matplotlib, Pandas, Scikit-Learn and more.
* Low level data structure(np.array)
* Large multidimensional arrays and matrices
* Wide range of mathematical operations can be performed on data structures
* `import numpy as np`

<strong>Pandas</strong>
-- Python library which provides high performance easy to use data structures and data analysis tools. Runs on top of NumPy (NumPy is a dependency of Pandas), so if you type `conda install pandas` in your terminal NumPy will also install automatically. Popular for data science, financial modeling, statistics, etc. 
* High level data structure (dataframes)
* More suited for dealing with `tabular` data (spreadsheets)
* Data alignment, fills in missing data, makes date friendlier to work with, etc.
* `import pandas as pd`

<strong>Comblined</strong>
* Use NumPy's calculation capabilities with Pandas' data structuring models to yield powerful and visual results

### Import packages

In [1]:
import pandas as pd
import numpy as np

### Create dataframe

In [2]:
user_dataframe = [
    {
        'id': 1,
        'first_name': 'Lucas',
        'last_name': 'Lang'
    },
    {
        'id': 2,
        'first_name': 'Joel',
        'last_name': 'Carter'
    },
]

for i in user_dataframe:
    print(i)

{'id': 1, 'first_name': 'Lucas', 'last_name': 'Lang'}
{'id': 2, 'first_name': 'Joel', 'last_name': 'Carter'}

In [3]:
data = [
    ['Student A', 'Standard', 92, 54, 88, 56, 99],
    ['Student B', 'Pre-AP', 65, 87, 67, 98, 55],
    ['Student C', 'Standard', 82, 84, 58, 6, 59],
    ['Student D', 'Pre-AP', 99, 99, 99, 99, 99],
    ['Student E', 'Standard', 100, 100, 100, 100, 100],
    ['Student F', 'AP', 75, 79, 83, 81, 80]
]

In [4]:
df = pd.DataFrame(
    data=data,
    index=list(range(len(data))),
    columns=['Name', 'Class Type', 'Quiz 1', 'Quiz_2', 'Quiz 3', 'Quiz 4', 'Quiz 5']
)

In [5]:
df

        Name Class Type  Quiz 1  Quiz_2  Quiz 3  Quiz 4  Quiz 5
0  Student A   Standard      92      54      88      56      99
1  Student B     Pre-AP      65      87      67      98      55
2  Student C   Standard      82      84      58       6      59
3  Student D     Pre-AP      99      99      99      99      99
4  Student E   Standard     100     100     100     100     100
5  Student F         AP      75      79      83      81      80

### Show data types,  indexes, columns, values

<p>
    <i>32-bit integer (int32) = 2,147,483,647</i>
</p>
<p>
    <i>64-bit integer (int64) = 9,223,372,036,854,775,807</i>
</p>

In [6]:
# pd.read_csv('./engagements.csv')

In [7]:
dir(pd)

['BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Float64Index',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int64Index',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt64Index',
 'UInt8Dtype',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__getattr__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_config',
 '_hashtable',
 '_is_numpy_dev',
 '_lib',
 '_libs',
 '_np_version_under1p18',
 '_testing',
 '_tslib',
 '_typing',
 '_version',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'read_xml',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

### Basic information about dataframe

In [8]:
df.describe()

           Quiz 1      Quiz_2     Quiz 3      Quiz 4      Quiz 5
count    6.000000    6.000000    6.00000    6.000000    6.000000
mean    85.500000   83.833333   82.50000   73.333333   82.000000
std     13.982131   16.821613   17.02645   37.071103   20.803846
min     65.000000   54.000000   58.00000    6.000000   55.000000
25%     76.750000   80.250000   71.00000   62.250000   64.250000
50%     87.000000   85.500000   85.50000   89.500000   89.500000
75%     97.250000   96.000000   96.25000   98.750000   99.000000
max    100.000000  100.000000  100.00000  100.000000  100.000000

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      object
 1   Class Type  6 non-null      object
 2   Quiz 1      6 non-null      int64
 3   Quiz_2      6 non-null      int64
 4   Quiz 3      6 non-null      int64
 5   Quiz 4      6 non-null      int64
 6   Quiz 5      6 non-null      int64
dtypes: int64(5), object(2)
memory usage: 384.0+ bytes

In [10]:
df.head()

        Name Class Type  Quiz 1  Quiz_2  Quiz 3  Quiz 4  Quiz 5
0  Student A   Standard      92      54      88      56      99
1  Student B     Pre-AP      65      87      67      98      55
2  Student C   Standard      82      84      58       6      59
3  Student D     Pre-AP      99      99      99      99      99
4  Student E   Standard     100     100     100     100     100

In [11]:
df.tail()

        Name Class Type  Quiz 1  Quiz_2  Quiz 3  Quiz 4  Quiz 5
1  Student B     Pre-AP      65      87      67      98      55
2  Student C   Standard      82      84      58       6      59
3  Student D     Pre-AP      99      99      99      99      99
4  Student E   Standard     100     100     100     100     100
5  Student F         AP      75      79      83      81      80

In [12]:
df.head(3)

        Name Class Type  Quiz 1  Quiz_2  Quiz 3  Quiz 4  Quiz 5
0  Student A   Standard      92      54      88      56      99
1  Student B     Pre-AP      65      87      67      98      55
2  Student C   Standard      82      84      58       6      59

In [13]:
# pandas.core.series.Series
df.dtypes

Name          object
Class Type    object
Quiz 1         int64
Quiz_2         int64
Quiz 3         int64
Quiz 4         int64
Quiz 5         int64
dtype: object

In [14]:
df.index

Int64Index([0, 1, 2, 3, 4, 5], dtype='int64')

In [15]:
df.columns

Index(['Name', 'Class Type', 'Quiz 1', 'Quiz_2', 'Quiz 3', 'Quiz 4', 'Quiz 5'], dtype='object')

### Statistical summary of data

In [16]:
df.describe().quantile()

Quiz 1    81.125000
Quiz_2    82.041667
Quiz 3    76.750000
Quiz 4    67.791667
Quiz 5    73.125000
Name: 0.5, dtype: float64

In [17]:
df['Quiz 1']

0     92
1     65
2     82
3     99
4    100
5     75
Name: Quiz 1, dtype: int64

In [18]:
df['Quiz_2']

0     54
1     87
2     84
3     99
4    100
5     79
Name: Quiz_2, dtype: int64

In [19]:
df.Name

0    Student A
1    Student B
2    Student C
3    Student D
4    Student E
5    Student F
Name: Name, dtype: object

In [20]:
df.describe()

           Quiz 1      Quiz_2     Quiz 3      Quiz 4      Quiz 5
count    6.000000    6.000000    6.00000    6.000000    6.000000
mean    85.500000   83.833333   82.50000   73.333333   82.000000
std     13.982131   16.821613   17.02645   37.071103   20.803846
min     65.000000   54.000000   58.00000    6.000000   55.000000
25%     76.750000   80.250000   71.00000   62.250000   64.250000
50%     87.000000   85.500000   85.50000   89.500000   89.500000
75%     97.250000   96.000000   96.25000   98.750000   99.000000
max    100.000000  100.000000  100.00000  100.000000  100.000000

In [21]:
df['Quiz_2'].mean()

83.83333333333333

In [22]:
# df.Quiz 1

### Sort all values by certain criteria

In [23]:
df.sort_values('Quiz 3', ascending=False)

        Name Class Type  Quiz 1  Quiz_2  Quiz 3  Quiz 4  Quiz 5
4  Student E   Standard     100     100     100     100     100
3  Student D     Pre-AP      99      99      99      99      99
0  Student A   Standard      92      54      88      56      99
5  Student F         AP      75      79      83      81      80
1  Student B     Pre-AP      65      87      67      98      55
2  Student C   Standard      82      84      58       6      59

In [24]:
# dir(df)

In [25]:
df.transpose().transpose().transpose().transpose().transpose().transpose()

        Name Class Type Quiz 1 Quiz_2 Quiz 3 Quiz 4 Quiz 5
0  Student A   Standard     92     54     88     56     99
1  Student B     Pre-AP     65     87     67     98     55
2  Student C   Standard     82     84     58      6     59
3  Student D     Pre-AP     99     99     99     99     99
4  Student E   Standard    100    100    100    100    100
5  Student F         AP     75     79     83     81     80

### Adding

In [26]:
new_data = ['Student G', 'AP', 100, 100, 83, 81, 80]

# data_to_add = pd.DataFrame(
#     data=new_data,
#     index=list(range(len(new_data))),
#     columns=['Name', 'Class Type', 'Quiz 1', 'Quiz 2', 'Quiz 3', 'Quiz 4', 'Quiz 5']
# )

# How to add a new individual record to your dataframe
df.loc[len(df)] = new_data

In [27]:
df

        Name Class Type  Quiz 1  Quiz_2  Quiz 3  Quiz 4  Quiz 5
0  Student A   Standard      92      54      88      56      99
1  Student B     Pre-AP      65      87      67      98      55
2  Student C   Standard      82      84      58       6      59
3  Student D     Pre-AP      99      99      99      99      99
4  Student E   Standard     100     100     100     100     100
5  Student F         AP      75      79      83      81      80
6  Student G         AP     100     100      83      81      80

### Slicing data

In [28]:
# object literal notation
# df['Quiz 2']

# object dot notation
# df.Name

In [29]:
df[2:5]

        Name Class Type  Quiz 1  Quiz_2  Quiz 3  Quiz 4  Quiz 5
2  Student C   Standard      82      84      58       6      59
3  Student D     Pre-AP      99      99      99      99      99
4  Student E   Standard     100     100     100     100     100

In [30]:
# retrieve subsection of a slice of column data
df[['Name', 'Quiz 1', 'Quiz_2']]

        Name  Quiz 1  Quiz_2
0  Student A      92      54
1  Student B      65      87
2  Student C      82      84
3  Student D      99      99
4  Student E     100     100
5  Student F      75      79
6  Student G     100     100

In [31]:
df.loc[5, ['Quiz 1', 'Quiz_2']]

Quiz 1    75
Quiz_2    79
Name: 5, dtype: object

In [32]:
df.loc[3, :]

Name          Student D
Class Type       Pre-AP
Quiz 1               99
Quiz_2               99
Quiz 3               99
Quiz 4               99
Quiz 5               99
Name: 3, dtype: object

In [33]:
df.loc[5, 'Quiz 1':'Quiz 4']

Quiz 1    75
Quiz_2    79
Quiz 3    83
Quiz 4    81
Name: 5, dtype: object

### Filtering

In [34]:
df[df['Quiz 1'] > 90]

        Name Class Type  Quiz 1  Quiz_2  Quiz 3  Quiz 4  Quiz 5
0  Student A   Standard      92      54      88      56      99
3  Student D     Pre-AP      99      99      99      99      99
4  Student E   Standard     100     100     100     100     100
6  Student G         AP     100     100      83      81      80

In [35]:
df.dtypes

Name          object
Class Type    object
Quiz 1         int64
Quiz_2         int64
Quiz 3         int64
Quiz 4         int64
Quiz 5         int64
dtype: object

In [36]:
df['Quiz 1'] > 90

0     True
1    False
2    False
3     True
4     True
5    False
6     True
Name: Quiz 1, dtype: bool

In [37]:
df.query("Name == 'Student E'")

        Name Class Type  Quiz 1  Quiz_2  Quiz 3  Quiz 4  Quiz 5
4  Student E   Standard     100     100     100     100     100

In [38]:
# NOTE: YOU NEED TO MAKE SURE YOUR COLUMN NAMES CAN BE REFERENCED AS ALL ONE WORD
df.query("Quiz_2 > 99")

        Name Class Type  Quiz 1  Quiz_2  Quiz 3  Quiz 4  Quiz 5
4  Student E   Standard     100     100     100     100     100
6  Student G         AP     100     100      83      81      80

In [39]:
# UNLESS YOU WANNA USE BACKTICKS, THEN THOSE ARE OK
df.query("`Quiz 1` > 99")

        Name Class Type  Quiz 1  Quiz_2  Quiz 3  Quiz 4  Quiz 5
4  Student E   Standard     100     100     100     100     100
6  Student G         AP     100     100      83      81      80

### Assignment

In [40]:
# df.rename(lambda c:c.replace(' ', '_'))
df.loc[5, 'Quiz 5'] = np.nan

In [41]:
df

        Name Class Type  Quiz 1  Quiz_2  Quiz 3  Quiz 4  Quiz 5
0  Student A   Standard      92      54      88      56    99.0
1  Student B     Pre-AP      65      87      67      98    55.0
2  Student C   Standard      82      84      58       6    59.0
3  Student D     Pre-AP      99      99      99      99    99.0
4  Student E   Standard     100     100     100     100   100.0
5  Student F         AP      75      79      83      81     NaN
6  Student G         AP     100     100      83      81    80.0

In [42]:
df['Quiz 5'].mean()

82.0

In [43]:
# The teacher wanted to void out everyone's quiz 5 score
df.loc[:, 'Quiz 5'] = np.nan

In [44]:
df

        Name Class Type  Quiz 1  Quiz_2  Quiz 3  Quiz 4  Quiz 5
0  Student A   Standard      92      54      88      56     NaN
1  Student B     Pre-AP      65      87      67      98     NaN
2  Student C   Standard      82      84      58       6     NaN
3  Student D     Pre-AP      99      99      99      99     NaN
4  Student E   Standard     100     100     100     100     NaN
5  Student F         AP      75      79      83      81     NaN
6  Student G         AP     100     100      83      81     NaN

In [45]:
df.loc[:, 'Quiz 5'] = 100
df

        Name Class Type  Quiz 1  Quiz_2  Quiz 3  Quiz 4  Quiz 5
0  Student A   Standard      92      54      88      56     100
1  Student B     Pre-AP      65      87      67      98     100
2  Student C   Standard      82      84      58       6     100
3  Student D     Pre-AP      99      99      99      99     100
4  Student E   Standard     100     100     100     100     100
5  Student F         AP      75      79      83      81     100
6  Student G         AP     100     100      83      81     100

In [46]:
df['Quiz 5'] = np.nan
df

        Name Class Type  Quiz 1  Quiz_2  Quiz 3  Quiz 4  Quiz 5
0  Student A   Standard      92      54      88      56     NaN
1  Student B     Pre-AP      65      87      67      98     NaN
2  Student C   Standard      82      84      58       6     NaN
3  Student D     Pre-AP      99      99      99      99     NaN
4  Student E   Standard     100     100     100     100     NaN
5  Student F         AP      75      79      83      81     NaN
6  Student G         AP     100     100      83      81     NaN

In [47]:
df['Quiz 5'] = 100
df

        Name Class Type  Quiz 1  Quiz_2  Quiz 3  Quiz 4  Quiz 5
0  Student A   Standard      92      54      88      56     100
1  Student B     Pre-AP      65      87      67      98     100
2  Student C   Standard      82      84      58       6     100
3  Student D     Pre-AP      99      99      99      99     100
4  Student E   Standard     100     100     100     100     100
5  Student F         AP      75      79      83      81     100
6  Student G         AP     100     100      83      81     100

### Rename columns

In [48]:
# .isna()
# .isnull()

df['Averages'] = (df['Quiz 1'] + df['Quiz_2'] + df['Quiz 3'] + df['Quiz 4'] + df['Quiz 5']) / 5

In [49]:
df.rename(columns={ 'Averages': 'Average' })

        Name Class Type  Quiz 1  Quiz_2  Quiz 3  Quiz 4  Quiz 5  Average
0  Student A   Standard      92      54      88      56     100     78.0
1  Student B     Pre-AP      65      87      67      98     100     83.4
2  Student C   Standard      82      84      58       6     100     66.0
3  Student D     Pre-AP      99      99      99      99     100     99.2
4  Student E   Standard     100     100     100     100     100    100.0
5  Student F         AP      75      79      83      81     100     83.6
6  Student G         AP     100     100      83      81     100     92.8

In [50]:
df = df.rename(columns={ 'Averages': 'Average' })

In [51]:
df.rename(columns={ 'Averages': 'Average' }, inplace=True)

In [52]:
df.rename(lambda c:c.lower().replace(' ', '_'), axis=1, inplace=True)

In [53]:
df

        name class_type  quiz_1  quiz_2  quiz_3  quiz_4  quiz_5  average
0  Student A   Standard      92      54      88      56     100     78.0
1  Student B     Pre-AP      65      87      67      98     100     83.4
2  Student C   Standard      82      84      58       6     100     66.0
3  Student D     Pre-AP      99      99      99      99     100     99.2
4  Student E   Standard     100     100     100     100     100    100.0
5  Student F         AP      75      79      83      81     100     83.6
6  Student G         AP     100     100      83      81     100     92.8

In [54]:
df.class_type

0    Standard
1      Pre-AP
2    Standard
3      Pre-AP
4    Standard
5          AP
6          AP
Name: class_type, dtype: object

### Interate over dataframe

In [55]:
for i in df:
    print(i)

name
class_type
quiz_1
quiz_2
quiz_3
quiz_4
quiz_5
average

In [56]:
df.iterrows()

In [57]:
for idx, row in df.iterrows():
    print(idx, row['class_type'], row.average)

0 Standard 78.0
1 Pre-AP 83.4
2 Standard 66.0
3 Pre-AP 99.2
4 Standard 100.0
5 AP 83.6
6 AP 92.8

### Save to CSV file

In [58]:
# df.to_csv('new_data.csv')
df.to_csv('new_data.csv', index=False)

### Load data from CSV file into Jupyter Notebook as a Pandas dataframe

In [59]:
new_df = pd.read_csv('new_data.csv')
new_df

        name class_type  quiz_1  quiz_2  quiz_3  quiz_4  quiz_5  average
0  Student A   Standard      92      54      88      56     100     78.0
1  Student B     Pre-AP      65      87      67      98     100     83.4
2  Student C   Standard      82      84      58       6     100     66.0
3  Student D     Pre-AP      99      99      99      99     100     99.2
4  Student E   Standard     100     100     100     100     100    100.0
5  Student F         AP      75      79      83      81     100     83.6
6  Student G         AP     100     100      83      81     100     92.8

In [60]:
s = pd.Series(pd.to_timedelta(np.arange(5), unit='d'))
s

0   0 days
1   1 days
2   2 days
3   3 days
4   4 days
dtype: timedelta64[ns]

In [61]:
s.dt.total_seconds()

0         0.0
1     86400.0
2    172800.0
3    259200.0
4    345600.0
dtype: float64